Creation of Terraform S3 backend bucket in S3:
terraform apply                                                                 bbrooks@Beast

Terraform used the selected providers to generate the following execution plan. Resource
actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.terraform-state-bucket will be created
  + resource "aws_s3_bucket" "terraform-state-bucket" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "terraform-state-bucket-20220211144530"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "Environment" = "Test"
          + "Name"        = "Terraform State Bucket"
          + "Terraform"   = "Bootstrap"
        }
      + tags_all                             = {
          + "Environment" = "Test"
          + "Name"        = "Terraform State Bucket"
          + "Terraform"   = "Bootstrap"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_s3_bucket.terraform-state-bucket: Creating...
aws_s3_bucket.terraform-state-bucket: Creation complete after 3s [id=terraform-state-bucket-20220211144530]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.